{
  "backend/main.mo": "Motoko canister managing users, videos, watch history, and authorization with profile creation, video upload, and watch logic.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to files, components, and test IDs for verification.",
  "frontend-file-summaries.txt": "Reference file containing autogenerated 1–2 sentence summaries for all frontend files.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx with favicon setup.",
  "frontend/src/App.tsx": "Main app router and layout configuration with navbar, footer, profile setup dialog, and theme provider.",
  "frontend/src/components/Auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication with loading states.",
  "frontend/src/components/Auth/ProfileSetupDialog.tsx": "Modal prompting new authenticated users to create a profile with a name and initial points.",
  "frontend/src/components/Layout/AppLayout.tsx": "Reusable layout wrapper providing centered content with configurable max width.",
  "frontend/src/components/NavBar.tsx": "Responsive navigation bar showing links, login, and user points with mobile menu support.",
  "frontend/src/components/Video/VideoCard.tsx": "Displays a video preview card with title, category, creator, and button to navigate to the video page.",
  "frontend/src/components/Video/WatchButton.tsx": "Handles watch permission logic and triggers video watching, showing alerts for auth, ownership, or low points.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the current user profile and exposes related query state; also includes a placeholder for fetching all profiles.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, managing identity loading, login, logout, and status handling.",
  "frontend/src/hooks/useQueries.ts": "Defines queries and mutations for videos, profiles, uploads, and watch actions with cache invalidation and toasts.",
  "frontend/src/index.css": "Tailwind setup defining color variables and theming for light and dark modes.",
  "frontend/src/lib/blob.ts": "Utility for converting files to ExternalBlob and generating URLs from blobs.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/HomePage.tsx": "Displays a searchable and filterable grid of videos with loading skeletons and user profile lookup.",
  "frontend/src/pages/ProfilePage.tsx": "Shows authenticated user profile details, uploaded videos, and watch history with tabbed navigation and loading states.",
  "frontend/src/pages/UploadPage.tsx": "Provides a form for authenticated users to upload videos with validation, progress tracking, and success feedback.",
  "frontend/src/pages/VideoDetailPage.tsx": "Renders a video player with metadata, creator info, and watch handling for a specific video ID.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugin setup for the project.",
  "project_state.json": "Defines the SkillSwap project state, including schema version, required features, design requirements, and image assets. Lists implemented features such as authentication, video upload, home feed, profile dashboard, and point-based watch rules."
}